
/*
Домашка:

1.  Ви прийшли в Макдональдз з трьома друзями.
    Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
    Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
    то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
    то виводити в консоль текст "Ми йдемо в інше кафе"
    (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)

2.  Напишіть умовну конструкцію if, що перевіряє, чи знаходиться значення ціни товару між 1000 та 1900 включно.
    Результат виводити в консоль.

3.  Напишіть конструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
    Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
    Результат виводити в консоль.

4.  За номером пори року вивести назву цієї пори року використовуючи оператор if-else-if
    Результат виводити в консоль.

5.  Задано 3 числа (a, b, c), які не рівні між собою.
    Визначити середнє мід цими трьома числами
    (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
    Використати вкладені оператори if
    Результат виводити в консоль.

6.  Задано номер дня тижня.
    За заданим номером вивести назву дня тижня використовуючи switch.
    Результат виводити в консоль.

7.  За допомогою switch реалізуйте обчислення виразу, передаючи у switch, як параметр, символ математичної операції.
    Математичні операції для обчислення: "+", "-", "*", "/".
    Результат виводити в консоль.

8. Використовуючи цикл for перемістити значення від 1 до 5 у масив myArray.

9. Напишіть 2 цикли.
   За допомогою першого передайте парні числа від 1 до 9 у myArray за допомогою циклу for.
   За допомогою другого передайте непарні числа від 1 до 9 у myArray за допомогою циклу for.

10. Оголоcіть та ініціалізуйте змінну total = 0.
    Використовуйте цикл for, щоб додати значення кожного елемента масиву myArr до підсумку.
    const myArr = [2, 3, 4, 5, 6];

11. Напишіть код, котрий виведе в консоль кожен піделемент в arr по одному.

    const arr = [ [1, 2], [3, 4], [5, 6] ];

    Console output:
    1
    2
    3
    4
    5
    6

12. Доповніть код нижче, так щоб в консоль повертався результат множення усіх чисел у підмасивах arr.
    Використайте для цього вкладені цикли for.

    Наприклад:
    const arr = [[1], [2], [3]]  >  console.log(product) має повернути 6
    const arr = [[1, 2], [3, 4], [5, 6, 7]]  >  console.log(product) має повернути 5040
    const arr = [[5, 1], [0.2, 4, 0.5], [3, 9]]  >  console.log(product) має повернути 54

    const arr = [[1, 2], [3, 4], [5, 6, 7]];

    let product = 1;

    // тут має бути ваше рішення

    console.log(product);

13.*  Використовуючи властивості рядків (тип string), та регулярний вираз (regular expression) видалити голосні букви зі слова.

14.*  Використовуючи оператор if реалізувати логіку переводу метрів в кілометри,
    так щоб в консоль виводився результат обчислень з правильним закінченням.
    Наприклад: 1000 метрів це 1 кілометр;  32 метри це 0,032 кілометра і т.д.

    Підказка(https://ukr-lifehacks.ed-era.com/rozdil-9/zvyazok_chislivnykiv)
*/

// =====================================================================
// task #1
/*
let gamburg = 3;
let kartofan = 1;
if (gamburg >= 4 && kartofan >= 1)
    {
    console.log('Ми поїли');
    }
   else 
     {
    console.log('Ми йдемо в інше кафе');
     }
     */
// =====================================================================
// task #2
/*
let price = 1900;
if (price > 999 && price < 1901)
    {
    console.log('yes');
    }
   else 
     {
    console.log('no');
     }
     */
// =====================================================================
// task #3
/*
let p = 1500;
if (p <= 999 || p >= 1901)
    {
    console.log('yes');
    }
   else 
     {
    console.log('no');
     }
*/
/*
let a = true;
let b = !a; 
let c = 1000;

if (c  < 1000 || c > 1900)
    {
    console.log(a);
    }
   else 
     {
    console.log(b);
     }
     */
// =====================================================================
// task #4
/*
let a = 9;
if (a <= 2 || a == 12)
    {
    console.log('winter');
    }
    else if (a >= 3 && a <= 5)
     {
    console.log('spring');
     }
     else if (a >= 6 && a <= 8)
     {
    console.log('summer');
     }
     else if (a >= 9 && a <= 11)
     {
    console.log('autumn');
     }
    */
// =====================================================================
// task #5
/*
let a = 2;
let b = 17;
let c = 8;

if (a > b && a < c || a < b && a > c )
{
console.log('A  is MIDDLE');
}    
else if (b > a && b < c || b < a && b > c )
{
console.log('B  is MIDDLE');
}   
else if (c > a && c < b || c < a && c > b )
{
console.log('C  is MIDDLE');
}   
*/
// =====================================================================
// task #6
/*
let  a = 7;
switch (a) {
    case 1:
        console.log('Monday');
        break;
        case 2:
            console.log('Wednesday');
            break;
            case 3:
                console.log('Tuesday');
                break;
                case 4:
                    console.log('Thursday');
                    break;
                    case 5:
                        console.log('Friday');
                        break;
                        case 6:
                            console.log('Saturday');
                            break;
                            case 7:
                                console.log('Sunday');
                                break;
}
*/
// =====================================================================
// task #7
/*
let a = 3;
let b = 3;
let c = a + b;
let d = a - b;
let e = a * b;
let f = a / b;
switch (f) {
    case a + b:
    console.log(c);
    break;
        case a - b:
        console.log(d);
        break;           
            case a * b:
            console.log(e);
            break;
                case a / b:
                console.log(f);
                break;
}
*/
// =====================================================================
// task #8 
/*
//I Variant
let myArray = [1, 2, 3, 4, 5];
for(let i = 1; i <=5; i++){
    console.log(i);
}

//II Variant
let myArray = [];
for(let i = 1; i <=5; i++){
    console.log(i);
}
*/
// =====================================================================
// task #9 
/*
let a = [];
for(let i = 2; i <10; i += 2){
    console.log(i);
}

for(let i = 1; i <10; i += 2){
    console.log(i);
}
*/
// =====================================================================
// task #10
/*Оголоcіть та ініціалізуйте змінну total = 0.
    Використовуйте цикл for, щоб додати значення кожного елемента масиву myArr до підсумку.
    const myArr = [2, 3, 4, 5, 6]; */


//    =НЕ ЗНАЮ=

// =====================================================================
// task #11
/* Напишіть код, котрий виведе в консоль кожен піделемент в arr по одному.

    const arr = [ [1, 2], [3, 4], [5, 6] ];

    Console output:
    1
    2
    3
    4
    5
    6 */

//    =НЕ ЗНАЮ=

// =====================================================================
// task #12

//    =НЕ ЗНАЮ=

// =====================================================================
// task #13 
/*
const word = "ёлка ежиха йогурт эквилибриум южная";
const modifiedWord = word.replace(/[аеёийоуэюя]/g, '');
console.log(modifiedWord); 
*/
// =====================================================================
// task #14 
// I variant
/*
let a = 12440; 
   b = a / 1000;
   console.log(b + " km");
   */
// II variant
/*
let a = 12;
let b = a / 1000;
if(a>=1){
    console.log(b + " km");
}
else if (a < 1){
    console.log("error");
}
*/



